Revit 2027 API
Polyloop Properties
The Polyloop type exposes the following members.
Properties
Name | Description
Centroid |  The polygon centroid.
Direction |  The direction for the outward normal for this polygon.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace